Catalogs/ПодпискиНаОчередиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПодпискиНаОчередиСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеЗадания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалОжиданияСобытия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Асинхронно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПодпискиНаОчередиСообщений/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьУникальностьЗадания(Отказ);
	
	Если Не Отказ Тогда
		ОбновитьРегламентноеЗадание();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьУникальностьЗадания(Отказ)
	
	Блокировка = Новый БлокировкаДанных;
	Элемент = Блокировка.Добавить("Справочник.ПодпискиНаОчередиСообщений");
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА
	|ИЗ
	|	Справочник.ПодпискиНаОчередиСообщений КАК ПодпискиНаОчередиСообщений
	|ГДЕ
	|	ПодпискиНаОчередиСообщений.Ссылка <> &Ссылка
	|	И ПодпискиНаОчередиСообщений.ИмяОчереди = &ИмяОчереди";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ИмяОчереди", ИмяОчереди);
	
	Отказ = Не Запрос.Выполнить().Пустой();
	
	Если Отказ Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Текст = СтрШаблон(НСтр("ru = 'Подписка на очередь %1 уже существует!'"), ИмяОчереди);
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьРегламентноеЗадание()
	
	Перем Задание;
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	КонецЕсли;
	
	Если Задание = Неопределено Тогда
		// TODO: Корявенько.
		МетаданноеРегламентного = 
			?(Асинхронно = Истина, 
						Метаданные.РегламентныеЗадания.ПолучениеСообщенийИзОчередейАсинх,
						Метаданные.РегламентныеЗадания.ПолучениеСообщенийИзОчередей
			);
		Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(МетаданноеРегламентного);
		ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	КонецЕсли;
	
	Задание.Наименование = Наименование;
	Задание.Расписание = РасписаниеЗадания.Получить();
	Задание.Использование = Не ПометкаУдаления И Активно;
	Задание.Ключ = ИмяОчереди;
	
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(ИмяОчереди);
	ПараметрыЗадания.Добавить(ИнтервалОжиданияСобытия);
	
	Задание.Параметры = ПараметрыЗадания;

	Задание.Записать();
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
		Если Задание <> Неопределено Тогда
			Задание.Удалить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ИдентификаторЗадания = Неопределено;
КонецПроцедуры
